import Container from "@/components/Container";
import Image from "next/image";
import { Blog } from "./components/Blog";

export default function page() {
  return (
    <main>
      <Container className="mt-12 mb-4">
        <header className="mb-8">
          <h1 className="font-bold max-md:text-2xl text-3xl mb-1">
            أفضل 5 طرق للحفاظ على أسنان بيضاء
          </h1>
          <p className="text-subtitle-color">قبل 12 ساعة</p>
        </header>
        <Image
          src={"/blogs/1.png"}
          width={1000}
          height={1000}
          alt="blog"
          className="w-full h-auto object-cover rounded-xl"
        />
        <p className="mt-8">
          نحن نؤمن أن الابتسامة الصحية تبدأ من عناية بسيطة يومية، لذلك نوفر أحدث
          التقنيات الطبية للحفاظ على أسنان قوية وبيضاء. في عيادتنا نركز على
          الراحة والثقة، حيث ندمج الخبرة الطبية مع الأجهزة الحديثة لنقدم علاجات
          شاملة تشمل التبييض، الحشوات التجميلية، تقويم الأسنان، وزراعة الأسنان.
          هدفنا أن يحصل كل مريض على ابتسامة طبيعية مشرقة تعكس شخصيته وتزيد من
          ثقته بنفسه.نحن نؤمن أن الابتسامة الصحية تبدأ من عناية بسيطة يومية،
          لذلك نوفر أحدث التقنيات الطبية للحفاظ على أسنان قوية وبيضاء. في
          عيادتنا نركز على الراحة والثقة، حيث ندمج الخبرة الطبية مع الأجهزة
          الحديثة لنقدم علاجات شاملة تشمل التبييض، الحشوات التجميلية، تقويم
          الأسنان، وزراعة الأسنان. هدفنا أن يحصل كل مريض على ابتسامة طبيعية
          مشرقة تعكس شخصيته وتزيد من ثقته بنفسه.نحن نؤمن أن الابتسامة الصحية
          تبدأ من عناية بسيطة يومية، لذلك نوفر أحدث التقنيات الطبية للحفاظ على
          أسنان قوية وبيضاء. في عيادتنا نركز على الراحة والثقة، حيث ندمج الخبرة
          الطبية مع الأجهزة الحديثة لنقدم علاجات شاملة تشمل التبييض، الحشوات
          التجميلية، تقويم الأسنان، وزراعة الأسنان. هدفنا أن يحصل كل مريض على
          ابتسامة طبيعية مشرقة تعكس شخصيته وتزيد من ثقته بنفسه.نحن
        </p>
        <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 xl:grid-cols-4 gap-4 mt-24 mb-10">
          <Blog />
          <Blog />
          <Blog />
        </div>
      </Container>
    </main>
  );
}
